# python中range()函数的用法

# python中range()函数可创建一个整数[序列],一般用在for循环中.

# range()函数语法:


# range(start,stop[,step])

#  参数说明:
# star: 计数从star开始.默认是从0开始.
# stop: 计数到stop结束,但不包括stop.
# step: 步长,默认为1.

# 实例:

range(10)        # 从 0 开始到 10,没有10
#[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
range(1, 11)     # 从 1 开始到 11,没有11
#[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
range(0, 30, 5)  # 步长为 5
#[0, 5, 10, 15, 20, 25]
range(0, 10, 3)  # 步长为 3
#[0, 3, 6, 9]
range(0, -10, -1) # 负数
#[0, -1, -2, -3, -4, -5, -6, -7, -8, -9]
range(0)
#[]
range(1, 0)
#[]
 
# 序列需要使用list()方法变成list打印出来
list(range(10))
#[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
