#!/usr/bin/env python3
# -*- coding: utf-8 -*-
# 为了让Python解释器读取源代码按UTF-8编码读取

#，%运算符就是用来格式化字符串的。在字符串内部，%s表示用字符串替换，%d表示用整数替换

'hello %s ,this is your address: %s,your code is %d' % ('adam','南京市浦口区',9527)

#格式化通配符
'%2d - %02d' % (3,1) # 2是最少2个字符， 02表示不够两个前面补零
'%8d - %08d' % (3,1) #'       3 - 00000001' 最少8个字符，8d前面补了7个空格，08补了7个0

'%09.2f' % (3.1415926) #总长度最少9个 包括小数点，小数点后2个，不足9位前面补零
'%.09f' % 3.1415926 #不够9位小数补0
'%.9f' % 3.1234567 # .09=.9
'%09.08f' % 3.123454321 #最少9位总长，小数点后8位优先，+3.合计10位  '3.12345432'
'%09.05f' % 3.123454 #'003.12345' 小数5位先算，+3.不够9位前面补零

#万能%s
'%s,%s,%s,%s' %(123,True,0x88ff,3.1e10)

r',%s,' % 3.14
r',%student' % 3.14 #r只对\ \n ' "有用
'%.2f%%student' % 3.141 #报错说明%s失效 被%%和谐 用%%来表示一个%

'hellp {0},your edge is {1:.2f}%,{{3}}'.format('adam',3.14) # {{表示一个{  }}表示 }

s1 =72
s2 = 85
r=(s2-s1)*100/s1
'小明成绩提升%.1f%%' % ((85-72)*100/72)
'小明成绩提升%4.1f%%' % r


# %d 会把flot取整
print('----[%d]' % (13/4))

# %f 会把3变成3.000000
print('----[%f]' % (12/4))